const Map<String, String> ar = {
  "startLearning": "ابدأ التعلم",
  "exploreMaps": "تصفح الخرائط",
  "challengeYourself": "اختبر معلوماتك",
  "aboutUs": "من نحن",
  "chooseALanguage": "اختر اللغة:",
  "mainPageTitle": "المحافظات العراقية",
  "mainPageSubtitle": "خريطة تفاعلية لتجربة تعليمية ممتعة",

  // CapitalCity Titles
  "Dihok": "دهوك",
  "Hewlêr": "هولير",
  "Samawah": "السماوة",
  "Silêmanî": "السليمانية",
  "Baqubah": "بعقوبة",
  "Kut": "الكوت",
  "Amarah": "العمارة",
  "Ramadi": "الرمادي",
  "Mosul": "الموصل",
  "Tikrit": "تكريت",
  "Kerkûk": "كركوك",
  "Hillah": "الحلة",
  "Al Diwaniyah": "الديوانية",
  "Nasiriyah": "الناصرية",

  // Provinces Titles
  "Iraqi Provinces": "المحافظات العراقية",
  "Baghdad": "بغداد",
  "Duhok": "دهوك",
  "Erbil": "اربيل",
  "Basra": "البصرة",
  "Muthanna": "المثنى",
  "Sulaymaniyah": "السليمانية",
  "Diyala": "ديالى",
  "Wasit": "واسط",
  "Maysan": "ميسان",
  "Al-Anbar": "الانبار",
  "Najaf": "النجف",
  "Ninawa": "نينوى",
  "Salah Al-Din": "صلاح الدين",
  "Kirkuk": "كركوك",
  "Babil": "بابل",
  "Al-Qadisiyyah": "القادسية",
  "Dhi Qar": "ذي قار",
  "Karbala": "كربلاء المقدسة",

  // Details Screen
  "Km2": " كم مربع",
  "Area:": "المساحة:",
  "Population:": "التعداد السكاني:",
  "Capital:": "مركز المحافظة:",
  "Interesting Fact:": "حقيقة مثيرة للاهتمام:",
  "moreInfo": "المزيد من المعلومات التاريخية",
  "moreAbout": "استمتع بقراءة المزيد عن ",

  // Explore Screen
  "exploreMapsTitle": "تصفح مختلف الخرائط العراقية",
  "terrain": "التضاريس",
  "rivers": "الانهار",
  "culturalSites": "المواقع التاريخية",

  // StartExam Screen
  "startExamTitle": "هل أنت مستعد للتحدي؟ اختبر معرفتك عن العراق من خلال إجراء هذا الاختبار ذو الخيارات المتعددة!",
  "chooseNumberOfQuestions": "اختر عدد الأسئلة بين 5 و 25",
  "startQuiz": "ابدأ الاختبار",

  // Exam Screen
  "chooseTheCorrectAnswer": "اختر الاجابة الصحيحة",
  "completed": " اكتمل",
  "showResults": "عرض النتائج",
  "next": "التالي",

  // Results Screen
  "quizResults": "نتيجة الاختبار",
  "yourScore": "لقد سجلت علامة",
  "wrongAnswers": "لم تجب على الاسئلة التالية بصورة صحيحة:",
  "finish": "انهاء الاختبار",

  // About Screen
  "madeFor": "تم تصميم هذا التطبيق لـ",
  "iraqi_ministry": "وزارة التربية العراقية",
  "karbala_education": "مديرية تربية كربلاء المقدسة",
  "baghdad_high_school": "مدرسة بغداد الثانوية للبنات",
  "by": "بواسطة",
  "faten": "فاتن صلاح عبد",
  "saja": "سجى جابر أحمد",

  // InterestingFacts
  "baghdadInterestingFact": "عاصمة العراق ومحافظة بغداد لها تاريخ غني يعود إلى القرن الثامن وكانت مرة واحدة واحدة من أكبر المدن في العالم خلال العصر الذهبي الإسلامي.",
  "duhokInterestingFact": "مدينة دهوك مشهورة بمناظرها الطبيعية الجميلة، بما في ذلك الجبال، وهي وجهة شهيرة للسياح.",
  "erbilInterestingFact": "قلعة أربيل هي واحدة من أقدم المواقع المأهولة باستمرار في العالم، مع دليل على السكن يعود إلى الأقل 6,000 سنة.",
  "basraInterestingFact": "تقع في جنوب العراق، تُعرف البصرة بـ 'البندقية الشرقية' بسبب شبكتها الواسعة من القنوات ودورها الهام في صناعة النفط العالمية.",
  "muthannaInterestingFact": "تضم مدينة أوروك القديمة، التي تعتبر واحدة من أولى المدن الرئيسية في تاريخ العالم وحيث تم العثور على أقدم أمثلة الكتابة.",
  "sulaymaniyahInterestingFact": "تُعرف بثقافتها النابضة بالحياة والفنون والمؤسسات التعليمية. يضم متحف السليمانية مجموعات أثرية هامة.",
  "diyalaInterestingFact": "تشتهر ديالى بتضاريسها المتنوعة، بما في ذلك الجبال والأنهار والسهول الخصبة. وقد كانت منطقة زراعية هامة على مر العصور.",
  "wasitInterestingFact": "تُعرف بمدينتها التاريخية كوت، التي كانت ميداناً معركة هامة خلال الحرب العالمية الأولى في معركة كوت.",
  "maysanInterestingFact": "تشتهر محافظة ميسان بمناطقها الأهوار الهامة، بما في ذلك الأهوار المركزية، التي تُعتبر موقع تراث عالمي لليونسكو.",
  "alAnbarInterestingFact": "هي أكبر محافظة في العراق من حيث المساحة، وتغطي جزءًا كبيرًا من المنطقة الغربية للبلاد.",
  "najafInterestingFact": "تضم المحافظة ضريح الإمام علي، ومقبرة وادي السلام، المعروفة بأنها أكبر مقبرة في العالم.",
  "ninawaInterestingFact": "تضم مدينة الموصل القديمة، بالإضافة إلى الآثار التاريخية لنينوى، التي كانت عاصمة للإمبراطورية الآشورية وواحدة من أقوى مدن بلاد ما بين النهرين القديمة.",
  "salahAlDinInterestingFact": "تحمل اسم القائد المسلم الشهير صلاح الدين، وتشتهر بمواقعها التاريخية، بما في ذلك آثار سامراء، الموقع التراثي العالمي لليونسكو.",
  "kirkukInterestingFact": "تشتهر كركوك بتنوع سكانها، الذي يتألف من الأكراد والعرب والتركمان والآشوريين. كما أنها غنية بالنفط، مما يجعلها مدينة مهمة استراتيجيًا في العراق.",
  "babilInterestingFact": "تضم مدينة بابل القديمة، واحدة من أشهر المدن في العصور القديمة، المشهورة بحدائقها المعلقة المبهرة، والتي تُعتبر واحدة من عجائب الدنيا السبع.",
  "alQadisiyyahInterestingFact": "تحمل هذه المحافظة اسم معركة القادسية، وهي معركة محورية بين الجيش العربي المسلم وإمبراطورية الساسانيين، مما أدى إلى الفتح الإسلامي لفارس.",
  "dhiQarInterestingFact": "تضم هذه المحافظة مدينة أور السومرية القديمة، التي يُعتقد أنها موطن إبراهيم من الكتاب المقدس والقرآن.",
  "karbalaInterestingFact": "تضم هذه المحافظة مدينة كربلاء المقدسة بسبب ضريح الإمام الحسين، حفيد النبي محمد."
};
